In [1]:
import pandas as pd
import numpy as np
data= {'A':[1,2,3,4],'B':[5,6,7,8],'C':[9,10,11,12]}
df = pd.DataFrame(data)

In [2]:
df['E']=[1,11,1111,1111]

In [3]:
df

   A  B   C     E
0  1  5   9     1
1  2  6  10    11
2  3  7  11  1111
3  4  8  12  1111

In [4]:
df.loc[4]= [1,2,3,4]

In [5]:
df

   A  B   C     E
0  1  5   9     1
1  2  6  10    11
2  3  7  11  1111
3  4  8  12  1111
4  1  2   3     4

In [6]:
df.rename(columns = {'D':'E'})

   A  B   C     E
0  1  5   9     1
1  2  6  10    11
2  3  7  11  1111
3  4  8  12  1111
4  1  2   3     4

In [7]:
df.rename(index={4:5})

   A  B   C     E
0  1  5   9     1
1  2  6  10    11
2  3  7  11  1111
3  4  8  12  1111
5  1  2   3     4

In [8]:
df = pd.DataFrame({'A':["AAA","bbb","Abc"],'B':["AAA","BBB","CCC"]})

In [9]:
df['A'].str.islower().sum()

1

In [10]:
df1 = pd.DataFrame({'Name':["Arun Chauhan","Ram Kumar"," Shyam Singh"],'Score':[12,15,18]})

In [11]:
df1[["F_name","L_name"]] = df1["Name"].str.split(expand = True)

In [12]:
df1

           Name  Score F_name   L_name
0  Arun Chauhan     12   Arun  Chauhan
1     Ram Kumar     15    Ram    Kumar
2   Shyam Singh     18  Shyam    Singh

In [13]:
import pandas as pd

# Create a sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35]}

df = pd.DataFrame(data)

In [14]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [15]:
for index,row in df.iterrows():
    print(index,row['Name'])

0 Alice
1 Bob
2 Charlie

In [16]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [17]:
df.rename(columns = {'Name':'F_Name'},inplace = True)
df

    F_Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [18]:
data = {'name':['karan','prakash','surya'],'scores':[100,10,55]}

In [19]:
df = pd.DataFrame(data)
df

      name  scores
0    karan     100
1  prakash      10
2    surya      55

In [20]:
df['total']=[100,100,100]

In [21]:
df

      name  scores  total
0    karan     100    100
1  prakash      10    100
2    surya      55    100

In [22]:
df.loc[3] = ['mady',25,100]

In [23]:
df.iloc[3]

name      mady
scores      25
total      100
Name: 3, dtype: object

In [24]:
df

      name  scores  total
0    karan     100    100
1  prakash      10    100
2    surya      55    100
3     mady      25    100

In [25]:
df.rename({'name':'naam'},inplace = True, axis =1)

In [26]:
df

      naam  scores  total
0    karan     100    100
1  prakash      10    100
2    surya      55    100
3     mady      25    100

In [27]:
df.rename({0:4},inplace = True,axis = 0)

      naam  scores  total
4    karan     100    100
1  prakash      10    100
2    surya      55    100
3     mady      25    100

In [32]:
df['naam'].str.islower().sum()

4

In [ ]:
apply